/* Задание 1
Console.WriteLine("Введите первое число: ");
int a = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите второе число: ");
int b = int.Parse(Console.ReadLine()!);
if (a > b)
{
    Console.WriteLine("Первое число больше второго!");
}
else
{
    Console.WriteLine("Второе число больше первого!");
}
*/

/* Задание 2
Console.WriteLine("Введите первое число: ");
int a = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите второе число: ");
int b = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите третье число: ");
int c = int.Parse(Console.ReadLine()!);
int max = a;
if (max < b)
{
    max = b;
}
if (max < c)
{
    max = c;
    Console.WriteLine("Самое большое число из трёх: " + max);
}
else
{
    Console.WriteLine("Самое большое число из трёх: " + max);
}
*/

